//Use an array to hold the value of the quotes
const arrayOfQuotes = [{
        'author': ' 💚 سيدنا محمد صلى الله عليه وسلم 💚 ',
        'quote': 'خيرُكُم مَن تعلَّمَ القرآنَ وعلَّمَهُ '
    },
    {
        'author': ' 💚 سيدنا محمد صلى الله عليه وسلم 💚 ',
        'quote': `قال رسول  الله صلى عليه وسلّم 
            (أكملُ المؤمنين إيمانًا أحسنُهم خُلُقًا ، وخيارُكم خياركُم لأهلِ) 
            صدق رسول الله صلى الله عليه وسلم
            `

    },
    {
        'author': ' 💚 سيدنا محمد صلى الله عليه وسلم 💚 ',
        'quote': `قال رسول  الله صلى عليه وسلّم 
            (ما شيءٌ أثقلُ في ميزانِ المؤمِنِ يومَ القيامةِ مِن خُلُقٍ حسَنٍ، فإنَّ اللَّهَ تعالى ليُبغِضُ الفاحشَ البَذيءَ)

            صدق رسول الله صلى الله عليه وسلم
            `
    },
    {
        'author': ' 💚 سيدنا محمد صلى الله عليه وسلم 💚 ',
        'quote': `قال رسول  الله صلى عليه وسلّم 
            (إنَّ اللهَ ليُبلِّغُ العبدَ بحُسنِ خُلقِه درجةَ الصَّومِ والصَّلاةِ)

            صدق رسول الله صلى الله عليه وسلم
            `
    },
    {
        'author': ' 💚 سيدنا محمد صلى الله عليه وسلم 💚 ',
        'quote': `قال رسول  الله صلى عليه وسلّم 
            (
                والذي نفسي بيده , لا تدخلوا الجنة حتى تؤمنوا , ولا تؤمنوا حتى تحابوا  ,أفلا أدلكم على شيء إذا فعلتموه تحاببتم؟ , أفشوا السلام , بينكم ) 
            صدق رسول الله صلى الله عليه وسلم
            `

    },
    {
        'author': ' 💚 سيدنا محمد صلى الله عليه وسلم 💚 ',
        'quote': `قال رسول  الله صلى عليه وسلّم 
            (إن الله – عز وجل – يقول يوم القيامة: أين المتحابون بجلالي؟ , اليوم أظلهم في ظلي , يوم لا ظل إلا ظلي) 
            صدق رسول الله صلى الله عليه وسلم
            `

    },
    {
        'author': ' 💚 سيدنا محمد صلى الله عليه وسلم 💚 ',
        'quote': `قال رسول  الله صلى عليه وسلّم 
            ( إن لله جلساء يوم القيامة عن يمين العرش – وكلتا يدي الله يمين – على منابر من نور , وجوههم من نور، ليسوا بأنبياء , ولا شهداء , ولا صديقين “، قيل: يا رسول الله من هم؟ , قال: ” المتحابون بجلال الله تعالى) 
            صدق رسول الله صلى الله عليه وسلم
            `

    },
    {
        'author': ' 💚 سيدنا محمد صلى الله عليه وسلم 💚 ',
        'quote': `قال رسول  الله صلى عليه وسلّم 
            (الأرواح جنود مجندة، فما تعارف منها ائتلف، وما تناكر منها اختلف) 
            صدق رسول الله صلى الله عليه وسلم
            `

    },
    {
        'author': ' 💚 سيدنا محمد صلى الله عليه وسلم 💚 ',
        'quote': `قال رسول  الله صلى عليه وسلّم 
            (البِرُّ حُسْنُ الخُلُقِ) 
            صدق رسول الله صلى الله عليه وسلم
            `

    },
    {
        'author': ' 💚 سيدنا محمد صلى الله عليه وسلم 💚 ',
        'quote': `قال رسول  الله صلى عليه وسلّم 
            (لا يُؤمِنُ أحدُكُمْ حتَّى يُحِبَّ لأخيه ما يُحِبُّ لنفسه) 
            صدق رسول الله صلى الله عليه وسلم
            `

    },
    {
        'author': ' 💚 سيدنا محمد صلى الله عليه وسلم 💚 ',
        'quote': `قال رسول  الله صلى عليه وسلّم 
            (الحسن والحسين ابناي، من أحبَّهما أحبَّني، ومن أحبَّني أحبَّه اللهُ، وَمَن أحبَّه الله أدخله الجنة، ومن أبغضَهُمَا أبغضَني، ومن أبغضَني أبغضَه الله، وَمَن أبغضه الله أدخلَه النَّار عَلى وجَهه) 
            صدق رسول الله صلى الله عليه وسلم
            `

    },
    {
        'author': ' 💚 سيدنا محمد صلى الله عليه وسلم 💚 ',
        'quote': `قال رسول  الله صلى عليه وسلّم 
            (ألا أحدِّثُكُم بأحبِّكم إليَّ وأقربِكُم منِّي مَجلسًا يومَ القيامةِ ؟ ثلاثَ مرَّاتٍ يقولُها  قلنا : بلى يا رسولَ اللَّهِ قالَ : أحسنُكُم أخلاقًا) 
            صدق رسول الله صلى الله عليه وسلم
            `

    },


];

function generateQuote() {
    var random = Math.floor(Math.random() * arrayOfQuotes.length);
    document.getElementById('quote').innerHTML = `${arrayOfQuotes[random].quote}`;
    document.getElementById('author').textContent = `${arrayOfQuotes[random].author}`;

}